Configuration/Enums/ТипыСтрокДереваПриложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСтрокДереваПриложений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсторияВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подзадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Приложение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РольФайла</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Соисполнители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Файл</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Configuration/CommonModules/РаботаСЗадачамиЛокализация/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Дополняет данные строки дерева приложений задачи
// См. РаботаСЗадачами.ДанныеДереваПриложений
// 
// Параметры:
//  Задача - ДокументСсылка.Задача
//  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи
//  СтрокаПриложения - см. РаботаСЗадачами.НоваяСтрокаДереваПриложений
//  КешДанных - Структура
//            - Неопределено
// 
Процедура ДополнитьСтрокуПриложенияДереваПриложений(Задача, ДействиеЗадачи, СтрокаПриложения, КешДанных = Неопределено) Экспорт
	
	// Локализация
	ЭлектронныеДокументыОбъектаУчета = ОбменЭДОДокументооборот.ЭлектронныеДокументыОбъектаУчета(
			СтрокаПриложения.Приложение);
		
	// Документ - Документ ЭДО.
	Для Каждого ДокументЭДО Из ЭлектронныеДокументыОбъектаУчета Цикл
		
		СтрокаЭДО = РаботаСЗадачами.НоваяСтрокаДереваПриложений();
		СтрокаЭДО.КлючСтроки = ДокументЭДО;
		СтрокаЭДО.ТипСтроки = Перечисления.ТипыСтрокДереваПриложений.ДокументЭДО;
		СтрокаЭДО.ПредставлениеПриложения = Строка(ДокументЭДО) + НСтр("ru = ' (Документ ЭДО)'");
		СтрокаЭДО.ИндексКартинки = 30; // как xml
		СтрокаЭДО.ДокументЭДО = ДокументЭДО;
		СтрокаПриложения.Строки.Добавить(СтрокаЭДО);
		
	КонецЦикла;
	// Конец Локализация

КонецПроцедуры

// Дополняет пустую структуру данных строки дерева приложений.
// 
// Параметры:
//  СтрокаДереваПриложений - Структура - См. РаботаСЗадачами.НоваяСтрокаДереваПриложений
Процедура ДополнитьНовуюСтрокуДереваПриложений(СтрокаДереваПриложений) Экспорт
	
// Локализация	
	СтрокаДереваПриложений.Вставить("ДокументЭДО", Документы.ЭлектронныйДокументВходящийЭДО.ПустаяСсылка());
// Конец Локализация
КонецПроцедуры

// Вызывается из ВыполнитьДействиеЗадачи общего модуля РаботаСЗадачами
//
// Параметры:
//  ДействиеЗадачи - ДокументСсылка.ДействиеЗадачи - Действие задачи.
//  РезультатДействия - СправочникСсылка.РезультатыДействийЗадач - Результат действия.
//  КтоОтметил - СправочникСсылка.Сотрудники - Кто отметил в программе.
//  ПараметрыВыполнения - Структура - Параметры выполнения. См. РаботаСЗадачамиКлиентСервер.НовыйПараметрыВыполненияДействийЗадач
//
Процедура ВыполнитьДействиеЗадачи(ДействиеЗадачи, РезультатДействия, КтоОтметил, ПараметрыВыполнения) Экспорт

// Локализация
	РаботаСВнешнимПодписанием.ПриВыполненииДействияЗадачи(ДействиеЗадачи, РезультатДействия,
		КтоОтметил, ПараметрыВыполнения);
// Конец Локализация
	
КонецПроцедуры

// Дополняет строку приложения задачи
// См. РаботаСЗадачами.ДанныеДереваПриложений
// 
// Параметры:
//  СтрокаДляОбработки - См. РаботаСЗадачами.НоваяСтрокаДереваПриложений
// 
// Возвращаемое значение:
//  Булево - Строка приложения обработана в этом методе, дальнейшей обработки не требуется
Функция ОбработатьСтрокуПриложения(СтрокаДляОбработки) Экспорт

// Локализация
	Если ЗначениеЗаполнено(СтрокаДляОбработки.ДокументЭДО) Тогда
		СтрокаДляОбработки.ИндексКартинки = 30;
	КонецЕсли;
// Конец Локализация

	Возврат Ложь;

КонецФункции

#КонецОбласти
